#include <stdio.h>

int main() {
    int score_int = 90.5;
    printf("กรณีที่ 1 (int): score = %d\n", score_int);

    float score_float = 90.5f;
    printf("กรณีที่ 2 (float): score = %.1f\n", score_float);

    return 0;
}
//ใช้ int จำนวนเต็ม เราใส่ค่า 90.5 แต่ตัวแปร int เก็บได้แค่เลขจำนวนเต็ม มันเลยตัด .5 ทิ้งไป กลายเป็น 90
//ใช้ float ออกแบบมาให้เก็บเลขที่มีจุดทศนิยมได้ ทำให้ค่าที่เก็บจะเป็น 90.5 ตามที่ใส่ไปเลย
//ถ้าเลือกชนิดข้อมูล Data Type ไม่ตรงกับค่าที่เก็บ อาจเกิดปัญหา เช่น ค่าคลาดเคลื่อน คำหาย เกิดError